Autodesk.Revit.UI.Electrical.ElectricalAnalyticalLoadSetUIData.GetEditedLoadSetId
Get current edited load set.

Autodesk.Revit.UI.Electrical.ElectricalAnalyticalLoadSetUIData.SetEditedLoadSetId(Autodesk.Revit.DB.ElementId)
Set current edited load set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.Electrical.ElectricalAnalyticalLoadSetUIData.SetCurrentLoads(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Set current loads in current load set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.Electrical.ElectricalAnalyticalLoadSetUIData.GetCurrentLoads
Get current loads in current load set.

Autodesk.Revit.UI.Electrical.ElectricalAnalyticalLoadSetUIData.SetAvailableLoads(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Set all the available loads that can be added to current load set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.Electrical.ElectricalAnalyticalLoadSetUIData.GetAvailableLoadMap
Get the available load map contains all the loads that can be added to current load set, and
its current corresponding LoadSet id.

Autodesk.Revit.UI.Electrical.ElectricalAnalyticalLoadSetUIData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.Electrical.ElectricalAnalyticalLoadSetUIData
The input and output data used by external UI servers for storing UI settings.
TODO: Change to ElementIdSet after getLoadSet exposed as public api in PointLoadData.